# brew tap Homebrew/bundle

##########
# tap
##########
# tap 'caskroom/cask'
# tap 'homebrew/php'

##########
# CLI
##########
brew 'emacs'
brew 'git'
brew 'go'
brew 'the_silver_searcher'
brew 'zsh'
brew 'jq'
brew 'peco'
brew 'tree'
brew 'source-highlight'
brew 'direnv'
brew 'wget'
brew 'gawk'
brew 'nkf'
brew 'tmux'
brew 'ansible'
brew 'nvm'
brew 'ghq'
brew 'hub'
brew 'mysql@5.7'
brew 'mysql-client@5.7'
brew 'reattach-to-user-namespace'
brew 'python'
brew 'watch'
brew 'gnupg'
brew 'pyenv'

# sound
brew 'ffmpeg'
brew 'flac'
brew 'vorbis-tools'
brew 'opus'
brew 'opus-tools'
brew 'sox'

# For build php
brew 're2c'
brew 'gmp'
brew 'icu4c'
brew 'libmcrypt'
brew 'libjpeg'
brew 'libpng'
brew 'libxml2'
brew 'libiconv'
brew 'libedit'
brew 'openssl'
brew 'autoconf'
brew 'automake'
brew 'bison'
brew 'zlib'
brew 'libzip'
brew 'bzip2'
brew 'curl'
brew 'curl-openssl'
brew 'tidy-html5'
brew 'fstab/oniguruma/oniguruma-5.9.6'
brew 'pkg-config'
brew 'krb5'

##########
# Cask
##########
# brew 'brew-cask'
# cask 'appcleaner'
# cask 'dropbox'
# cask 'firefox'
# cask 'google-chrome'
# cask 'google-japanese-ime'
# cask 'iterm2'
# cask 'karabiner'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'coteditor'
# cask 'hoster'
# cask 'kindle'
# cask 'totalfinder'
# cask '1password'
# cask 'xquartz'
# cask 'alfred'
# cask 'astah-community'
# cask 'licecap'
# cask 'chefdk'
